Update: change to mermaid
